src/cf/InformationRegisters/НастройкиПодключенияЛокальныхМодулейМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодключенияЛокальныхМодулейМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СерверПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФорматОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаОбменаЛокальногоМодуляИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаОбменаЛокальногоМодуляМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиПодключенияЛокальныхМодулейМДЛП/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонАдресаСПортом  = "%1%2:%3";
	ШаблонАдресаБезПорта = "%1%2";
	
	ИзмененАдресПодключения = Ложь;
	
	ДанныеДляПроверки = ИнициализироватьТаблицуДанныхДляПроверки();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		ТекущийАдресПодключения = Запись.АдресПодключенияЛМ;
		
		Если ЗначениеЗаполнено(Запись.ПортПодключенияЛМ) Тогда
			
			Запись.АдресПодключенияЛМ = СтрШаблон(ШаблонАдресаСПортом, Формат(Запись.ЗащищенноеСоединение, "БЛ=http://; БИ=https://;"),
				Запись.СерверПодключенияЛМ,
				Формат(Запись.ПортПодключенияЛМ, "ЧГ=0;"));
				
		Иначе
			
			Запись.АдресПодключенияЛМ = СтрШаблон(ШаблонАдресаБезПорта,
				Формат(Запись.ЗащищенноеСоединение, "БЛ=http://; БИ=https://;"),
				Запись.СерверПодключенияЛМ);
				
		КонецЕсли;
		
		ИзмененАдресПодключения = (Запись.АдресПодключенияЛМ <> ТекущийАдресПодключения);
		
		СтруктураПолученияПароля = РегистрыСведений.НастройкиПодключенияЛокальныхМодулейМДЛП.КонструкторЗаписиВладельцаПароля();
		ЗаполнитьЗначенияСвойств(СтруктураПолученияПароля, Запись);
		
		Запись.ХешСумма = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(СтруктураПолученияПароля);
		
		СтрокаПроверки = ДанныеДляПроверки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПроверки, Запись);
		
	КонецЦикла;
	
	Если (Замещение = Истина Или ОбщегоНазначения.ЭтоЗамещениеНабораЗаписей(Замещение)) И Не ИзмененАдресПодключения Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьДублиЛокальныхМодулейПоОрганизациям(ДанныеДляПроверки, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализироватьТаблицуДанныхДляПроверки()
	
	ТаблицаДанных = Новый ТаблицаЗначений();
	
	ТаблицаДанных.Колонки.Добавить("Организация",        Новый ОписаниеТипов("СправочникСсылка.ОрганизацииМДЛП"));
	ТаблицаДанных.Колонки.Добавить("РабочееМесто",       Новый ОписаниеТипов("СправочникСсылка.РабочиеМеста"));
	ТаблицаДанных.Колонки.Добавить("АдресПодключенияЛМ", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	ТаблицаДанных.Колонки.Добавить("ОбменНаСервере",     Новый ОписаниеТипов("Булево"));
	ТаблицаДанных.Колонки.Добавить("Приоритет",          ОбщегоНазначения.ОписаниеТипаЧисло(3, 0, ДопустимыйЗнак.Неотрицательный));
	
	Возврат ТаблицаДанных;
	
КонецФункции

Процедура ПроверитьДублиЛокальныхМодулейПоОрганизациям(ДанныеДляПроверки, Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеДляПроверки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ТаблицаПроверки.Организация        КАК Организация,
	|	ТаблицаПроверки.РабочееМесто       КАК РабочееМесто,
	|	ТаблицаПроверки.АдресПодключенияЛМ КАК АдресПодключенияЛМ,
	|	ТаблицаПроверки.ОбменНаСервере     КАК ОбменНаСервере,
	|	ТаблицаПроверки.Приоритет          КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ТаблицаПроверки
	|ИЗ
	|	&ТаблицаПроверки КАК ТаблицаПроверки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПроверки.Организация                       КАК Организация,
	|	ВТ_ТаблицаПроверки.РабочееМесто                      КАК РабочееМесто,
	|	ВТ_ТаблицаПроверки.АдресПодключенияЛМ                КАК АдресПодключенияЛМ,
	|	ВТ_ТаблицаПроверки.ОбменНаСервере                    КАК ОбменНаСервере,
	|	НастройкиПодключенияЛокальныхМодулей.Организация КАК ОрганизацияНастроенногоПодключения
	|ИЗ
	|	РегистрСведений.НастройкиПодключенияЛокальныхМодулейМДЛП КАК НастройкиПодключенияЛокальныхМодулей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаПроверки КАК ВТ_ТаблицаПроверки
	|		ПО ВТ_ТаблицаПроверки.РабочееМесто = НастройкиПодключенияЛокальныхМодулей.РабочееМесто
	|		И ВЫРАЗИТЬ(ВТ_ТаблицаПроверки.АдресПодключенияЛМ КАК
	|			СТРОКА(500)) = ВЫРАЗИТЬ(НастройкиПодключенияЛокальныхМодулей.АдресПодключенияЛМ КАК СТРОКА(500))
	|		И ВТ_ТаблицаПроверки.ОбменНаСервере = НастройкиПодключенияЛокальныхМодулей.ОбменНаСервере
	|");
	
	Запрос.УстановитьПараметр("ТаблицаПроверки", ДанныеДляПроверки);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ШаблонСообщения = НСтр("ru = 'Локальный модуль %1 уже настроен для работы организации %2.'");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РабочееМесто) Тогда
			
			ШаблонПредставленияЛокальногоМодуля = НСтр("ru = '%1 (%2)'");
			ПредставлениеЛокальногоМодуля       = СтрШаблон(ШаблонПредставленияЛокальногоМодуля, ВыборкаДетальныеЗаписи.АдресПодключенияЛМ, ВыборкаДетальныеЗаписи.РабочееМесто);
			
		Иначе
			
			ШаблонПредставленияЛокальногоМодуля = НСтр("ru = '%1'");
			ПредставлениеЛокальногоМодуля       = СтрШаблон(ШаблонПредставленияЛокальногоМодуля, ВыборкаДетальныеЗаписи.АдресПодключенияЛМ);
			
		КонецЕсли;
		
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПредставлениеЛокальногоМодуля, ВыборкаДетальныеЗаписи.ОрганизацияНастроенногоПодключения);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
